package homeworks.regular_expressions;

/**
 * Пользователь вводит телефон в формате (ххх)ххх-хх-хх.
 (ххх) может быть таким: (095), (097), (073), (067), (099), (063).
 Проверить, чтобы 7 - ый номер был в формате "(ххх)ххх-хх-хх".
 Если пользователь вводит номер начинающийся на(095) или (099) ххх-хх-хх, выводить в консоль "Пользователь имеет МТС номер",
 на(097) или (067) ххх-хх-хх, выводить в консоль "Пользователь имеет Киевстар номер",
 на(073) или (063) ххх-хх-хх, выводить в консоль "Пользователь имеет Лайф номер"
 */
public class AmountNumberDigitFive {
    public static void main(String[] args) {

    }
}
