package homeworks.three_calculyator;

/**
 * Created by antoni on 25.04.2018.
 * Создать калькулятор:
 Метод класса возвращает значение для операции. Создать методы под действия *, /, -, +, %.
 Создать два public метода, возвращающих случайные числа.
 Каждый метод класса вызывает один из методов(возвращают случайные числа), чтобы получить значения для операций.
 Протестировать методы, выполняющие мат. действия. Для каждой операции в тесте возвращать разные значения используя Mockito + verify.
 Создать private методы, возвращающих случ. числа и сделать аналогичные операции, использовав PowerMock + verify.
 Создать public static методы, возвращающих случ. числа и сделать аналогичные операции.PowerMock + verify
 */
public class CalculatorHome {
}

