package lessons.IncrementDecrement;

/**
 * Создать два массива из 20 чисел. Первый массив проинициализировать четными числами.
 Проинициализировать второй массив элементами первого массива при условии,
 что индекс делится на 4 без остатка и элемент больше 3, но меньше 16.
 Если условие не выполняется оставить элемент массива без изменения.

 */
public class MassEvenNumbers {

        int[] array1 = new int[20];
        int[] array2 = new int[20];
    public static void main(String[] args) {
        int [] array1 = {2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40};
    }

}
